#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПредварительныйПросмотрФайлов

Процедура НастроитьФормуДляПросмотраФайлов(Форма) Экспорт
	          	
	ПредварительныйПросмотрСервер.ДобавитьОбщиеРеквизитыФормы(Форма);	
	ПредварительныйПросмотрСервер.УстановитьОбщиеЗначенияРеквизитовФормы(Форма);
	ДобавитьЭлементыФормы(Форма);
	
КонецПроцедуры

Процедура ДобавитьЭлементыФормы(Форма)
	
	Элементы = Форма.Элементы;
	
	ЭлементФормы_ВебПредставлениеФайла = Элементы.Добавить("ВебПредставление", Тип("ПолеФормы"));
	ЭлементФормы_ВебПредставлениеФайла.Вид = ВидПоляФормы.ПолеHTMLДокумента;
	ЭлементФормы_ВебПредставлениеФайла.ПутьКДанным = "ВебПредставление";
	ЭлементФормы_ВебПредставлениеФайла.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	                     	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
	
#КонецЕсли