
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПредварительныйПросмотрФайлов") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ПредварительныйПросмотрСервер.ПриСозданииФормы(ЭтаФорма, Отказ);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПросмотр(Команда)
	ВывестиВебПредставление();
КонецПроцедуры

&НаКлиенте
Процедура АдресСсылкиПриИзменении(Элемент)
	ВывестиВебПредставление();
КонецПроцедуры

&НаСервере
Процедура ВывестиВебПредставление()
	
	ОписаниеФайла = РегистрыСведений.ИменаФайловВСервисеПросмотра.ПолучитьИмя(ФайлСсылка);		
	ПредварительныйПросмотрСервер.ВывестиВебПредставлениеВОкно(ЭтаФорма, "ВебПредставление", ОписаниеФайла);	
	
КонецПроцедуры


