
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                    	
	Если НЕ ПредварительныйПросмотрСервер.СервисДоступен() Тогда
		Отказ = Истина;
		Сообщить(ПредварительныйПросмотрСервер.ТекстСервисНедоступен());
		Возврат;
	КонецЕсли;          
	
	Запрос = ПредварительныйПросмотрСервер.ВыполнитьМетодСервиса("allowedExt");
	ДоступныеИсточники = СтрРазделить(Запрос.Ответ, " ");	
	Элементы.Источник.СписокВыбора.ЗагрузитьЗначения(ДоступныеИсточники);
	
	Если НЕ Параметры.Ключ.Пустой() Тогда		
		УстановитьСписокРасширенийПолучателей();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	Запись.Получатель = Неопределено;
	УстановитьСписокРасширенийПолучателей();
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокРасширенийПолучателей()

	Запрос = ПредварительныйПросмотрСервер.ВыполнитьМетодСервиса("allowedExtForExt", Новый Структура("Расширение", Запись.Источник));
	ДоступныеИсточники = СтрРазделить(Запрос.Ответ, " ");	
	Элементы.Получатель.СписокВыбора.ЗагрузитьЗначения(ДоступныеИсточники);    

КонецПроцедуры

